; Prove that Fib(n) is the closest integer to ϴ^n/√5 where ϴ = (1 + √5)/2
; Hint: prove that Fib(n) = (ϴ^n - x^n)/√5

1 = (a - b)/√5
1 = (a^2 - b^2)/√5

a - b = √5
a + b = 1

a = (1 + √5)/2
b = (a - √5)/2

a^(n+2) - b^(n+2)   a^(n+1) - b^(n+1)   a^n - b^n
----------------- = ----------------- = ----------
        √5                  √5              √5

a^(n+2) - a^(n+1) - a^n = b^(n+2) - b^(n+1) - b^n
a^n(a^2 - a -1) = b^n(b^2 - b - b)

Fib(n) = a^n - b^n , n>= 0
        ----------
            √5

= a^n     b^n
  ---  -  ---
  √5       √5

= a^n    √5-1  ^n    1
  --- + (----)    * ---
  √5       2         √5

2 < √5 < 3
1 < √5 - 1 < 2
1/2 < (√5-1)/2 < 1
1/4 < ((√5-1)/2)^n < 1
1/12 < (((√5-1)/2)^n)/√5 < 1/2

Fib(n) is closest integer to (((√5-1)/2)^n)/√5